      /*%METADATA                                                     */
      /* %TEXT EOL/400データ入力(TFRCTL AOC040)                            */
      /*%EMETADATA                                                    */
/*********************************************************************/
/*               (C)  COPYRIGHT IBM JAPAN,1988.                      */
/*********************************************************************/
PGM
TFRCTL QEOL/AOC040
ENDPGM
