      /*%METADATA                                                     */
      /* %TEXT EOL/400仮の受注入力プログラム                                     */
      /*%EMETADATA                                                    */
/* 仮のＣＬプログラム　ＣＬＰ１１Ｃ */
PGM
DCL &PGM *CHAR 10 'CLP11C'
DCL &WS  *CHAR 10
DCL &MSG *CHAR 80
RTVJOBA JOB(&WS)
CHGVAR &MSG ('仮のＣＬプログラム' *CAT &PGM *TCAT 'が実行された')
SNDUSRMSG MSG(&MSG) MSGTYPE(*INFO) TOMSGQ(&WS)
ENDPGM
