      /*%METADATA                                                     */
      /* %TEXT EOL/400実習・管理メニュー(TFRCTL AAC900)                        */
      /*%EMETADATA                                                    */
/*********************************************************************/
/*               (C)  COPYRIGHT IBM JAPAN,1989.                      */
/*********************************************************************/
PGM
TFRCTL QEOL/AAC900
ENDPGM
