      *%METADATA                                                       *
      * %TEXT 受注見出しファイル(KEY-JHTIKU,JHTOKB,JHCHUB)                      *
      *%EMETADATA                                                      *
     A*受注見出し　論理ファイル　ＪＵＭＩＤＬ０２
     A          R JUMIDR                    PFILE(JUMIDP)
     A          K JHTIKU
     A          K JHTOKB
     A          K JHCHUB
