      *%METADATA                                                       *
      * %TEXT EOL/400受注見出しファイル(KEY-JHTOKB,JHCHUB)                      *
      *%EMETADATA                                                      *
     A*受注見出し　論理ファイル　ＪＵＭＩＤＬ０１
     A          R JUMIDR                    PFILE(JUMIDP)
     A          K JHTOKB
     A          K JHCHUB
